### Terraform Plan Result

#### Format: `failure`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Plan Output</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/hc-demo/hc-demo/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/hc-demo/hc-demo

To view this run in a browser, visit:
https://app.terraform.io/app/rikodao-org/soc2-compliance-demo/runs/run-5zmF4A1A6PemXN56

Waiting for the plan to start...

Terraform v1.14.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.access_logs will be created
  + resource "aws_s3_bucket" "access_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "nextpay-soc2-demo-access-logs-production"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Compliance" = "soc2-type2"
          + "Name"       = "nextpay-soc2-demo-access-logs"
          + "Purpose"    = "audit-trail"
        }
      + tags_all                    = {
          + "Compliance"  = "soc2-type2"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nextpay-soc2-demo-access-logs"
          + "Project"     = "nextpay-soc2-demo"
          + "Purpose"     = "audit-trail"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.data_store will be created
  + resource "aws_s3_bucket" "data_store" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "nextpay-soc2-demo-data-production"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Compliance" = "soc2-type2"
          + "CostCenter" = "engineering"
          + "DataClass"  = "confidential"
          + "Name"       = "nextpay-soc2-demo-data-store"
          + "Owner"      = "platform-team"
        }
      + tags_all                    = {
          + "Compliance"  = "soc2-type2"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nextpay-soc2-demo-data-store"
          + "Owner"       = "platform-team"
          + "Project"     = "nextpay-soc2-demo"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_logging.data_store[0] will be created
  + resource "aws_s3_bucket_logging" "data_store" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "s3-access-logs/"
    }

  # aws_s3_bucket_public_access_block.access_logs will be created
  + resource "aws_s3_bucket_public_access_block" "access_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.data_store will be created
  + resource "aws_s3_bucket_public_access_block" "data_store" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.access_logs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "aws:kms"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.data_store[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "data_store" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "aws:kms"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.data_store will be created
  + resource "aws_s3_bucket_versioning" "data_store" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + data_bucket_arn    = (known after apply)
  + data_bucket_name   = (known after apply)
  + encryption_enabled = true
  + logs_bucket_arn    = (known after apply)

------------------------------------------------------------------------

Organization Policy Check:

=================== Results for policy set: soc2-s3-policies ===================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

2 policies evaluated.

## Policy 1: soc2-s3-policies/enforce-s3-encryption (hard-mandatory)

Result: true

Description:
  enforce-s3-encryption.sentinel  SOC2 Type 2 - Preventive Control  Ensures all S3 buckets have server-side encryption configured

./enforce-s3-encryption.sentinel:25:1 - Rule "main"
  Description:
    Main rule - hard-mandatory: cannot be overridden

  Value:
    true

./enforce-s3-encryption.sentinel:20:1 - Rule "verify_encryption"
  Description:
    Verify each bucket has an encryption configuration

  Value:
    true

## Policy 2: soc2-s3-policies/require-public-access-block (hard-mandatory)

Result: true

Description:
  require-public-access-block.sentinel  SOC2 Type 2 - Preventive Control  Ensures all S3 buckets block public access

./require-public-access-block.sentinel:21:1 - Rule "main"
  Value:
    true

./require-public-access-block.sentinel:12:1 - Rule "all_blocks_enforced"
  Value:
    true



─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

> **SOC2 Note**: This run uses OIDC-based dynamic credentials via Vault.
> No static AWS keys are stored in this repository or CI/CD pipeline.

*Pushed by: @rikodao, Action: `pull_request`*